---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HandrailProjectionParam
source: html/4c70d0b5-eee1-1f3a-edb2-e69f63aceacd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HandrailProjectionParam Property

"Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId HandrailProjectionParam { get; }
```